"""
Задание 2: Сумма двух чисел

Описание: Напишите функцию, которая принимает два числа и возвращает их сумму.

Вход: Два числа (например, 5 и 3)

Выход: Число — результат сложения.

Пример:

def add_numbers(a: int, b: int) -> int:
    # Ваша реализация

"""


def add_numbers(a: int, b: int) -> int:
    return a + b


print(add_numbers(5, 3))
